# -*- coding: UTF-8 -*-

import numpy as np

#行列の確認
def getMatrix(l, r, b, t, n, f):
	#mtx = np.arrange(16).reshape(4,4)
	return	[
		[2*n/(r-l), 0, (r+l)/(r-l), 0],
		[0, 2*n/(t-b), (t+b)/(t-b), 0],
		[0, 0, -(f+n)/(f-n), -2*f*n/(f-n)],
		[0, 0, -1, 0]
	]

mtx = getMatrix(-1,1,-1,1,0.3,100)
print(mtx)
print(np.dot(mtx, [0,0,-0.3,1]))
print(np.dot(mtx, [0,0,-0.35,1]))
print(np.dot(mtx, [0,0,-0.5,1]))
print(np.dot(mtx, [0,0,-1.,1]))
print(np.dot(mtx, [0,0,-2.,1]))
print(np.dot(mtx, [0,0,-3.,1]))
print(np.dot(mtx, [0,0,-50.,1]))
print(np.dot(mtx, [0,0,-100.,1]))

#	結果
#[[0.3, 0, 0.0, 0], [0, 0.3, 0.0, 0], [0, 0, -1.0060180541624875, -0.601805416247462], [0, 0, -1, 0]]
#[ 0. 0. -0.3 0.3]
#[ 0. 0. -0.2496991 0.35]
#[ 0. 0. -0.09879639 0.5]
#[ 0. 0. 0.40421264 1.]
#[ 0. 0. 1.41023069 2.]
#[ 0. 0. 2.41624875 3.]
#[ 0. 0. 49.69909729 50.]
#[ 0. 0. 100. 100.]

